<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"tts-10x-atj-dev","backend":"50e14c4c0f99ece5739724b38541b287365e596aecbe79ad3835e8769e1a6244","plan_job_ref":"Job Post Terraform plan to PR comment #406 at https://github.com/GSA-TTS/forms/actions/runs/11748606106","plan_out_hash":"46bf1cb6da936fc1ab42ce7fe7fbb443b81f49b458781e40834d0d17e31b8351","plan_hash":"e7c88cb28ca2977053f208dcfecf5a71458c36ce90407455575d15b04a81af38","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __tts-10x-atj-dev__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudfoundry_app.tts-10x-atj-dev-server-doj_tts-10x-atj-dev-server-doj-app_380DB029 will be created
+   resource "cloudfoundry_app" "tts-10x-atj-dev-server-doj_tts-10x-atj-dev-server-doj-app_380DB029" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/forms/server-doj:bdfbf8593db36404d8817045bdfebc0293d82230"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-atj-dev-server-doj-app"
+       ports                           = (known after apply)
+       space                           = "97f871cd-ea2a-4728-a556-aa7d34204f75"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = "6e003acf-4bc4-497b-9116-10a28dcdf37e"
        }

+       service_binding {
+           service_instance = "5ca5c49e-9609-4271-8d88-6c7d57ae5612"
        }
+       service_binding {
+           service_instance = "b4cba13d-f667-40eb-95e1-308eec6a5673"
        }
    }

  # cloudfoundry_app.tts-10x-atj-dev-server-kansas_tts-10x-atj-dev-server-kansas-app_337A9CF1 will be created
+   resource "cloudfoundry_app" "tts-10x-atj-dev-server-kansas_tts-10x-atj-dev-server-kansas-app_337A9CF1" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/forms/server-kansas:bdfbf8593db36404d8817045bdfebc0293d82230"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-atj-dev-server-kansas-app"
+       ports                           = (known after apply)
+       space                           = "97f871cd-ea2a-4728-a556-aa7d34204f75"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = "fa9cb908-8382-4a28-97d4-c298ebebdb6f"
        }

+       service_binding {
+           service_instance = "0e47e45a-6ecf-4d5e-8e45-1a8c754a555f"
        }
+       service_binding {
+           service_instance = "83d706dc-757e-41da-bba8-505095c55bd0"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Post Terraform plan to PR comment #406](https://github.com/GSA-TTS/forms/actions/runs/11748606106)